In [66]:
import pandas as pd
import numpy as np

#### Series
데이터프레임의 하나의 column, feature를 의미함

기본적으로는 numpy array의 subclass

In [67]:
from pandas import Series, DataFrame

In [68]:
example_obj = Series(['a', 'b', 3, 4, 5])    # 일종의 객체처럼 사용
example_obj   # index와 value로 구성되어 있음

0    a
1    b
2    3
3    4
4    5
dtype: object

In [69]:
list_data = [1, 2, 3, 4, 5]
list_name = ['a', 'b', 'c', 'd', 'e']
Series(data=list_data, index = list_name)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [70]:
dict_data = {'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4, 'e' : 5}
example_obj = Series(dict_data, name = 'Series from dict')
example_obj

a    1
b    2
c    3
d    4
e    5
Name: Series from dict, dtype: int64

In [71]:
print(example_obj)
example_obj['a'] = 3
print(example_obj)

a    1
b    2
c    3
d    4
e    5
Name: Series from dict, dtype: int64
a    3
b    2
c    3
d    4
e    5
Name: Series from dict, dtype: int64

In [72]:
print(example_obj.values)
print(example_obj.index)
   # values와 index만 np.array 형태로 추출할 수 있음

[3 2 3 4 5]
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [73]:
example_obj = Series([5, 4, 3, 2, 1, 2, 3, 4, 5])
example_obj[example_obj > 2]      # boolean index 적용 가능

0    5
1    4
2    3
6    3
7    4
8    5
dtype: int64

In [74]:
example_obj * 2      # broadcasting 적용 가능

0    10
1     8
2     6
3     4
4     2
5     4
6     6
7     8
8    10
dtype: int64

#### DataFrame

In [75]:
raw_data = {'first_name' : ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
           'lsat_name' : ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
           'age' : [42, 52, 36, 24, 73],
           'city' : ['San Francisco',  'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason       NaN   42  San Francisco
1      Molly       NaN   52      Baltimore
2       Tina       NaN   36          Miami
3       Jake       NaN   24        Douglas
4        Amy       NaN   73         Boston

In [76]:
pd.DataFrame(raw_data, columns = ['age', 'city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [77]:
df = DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])
df

  first_name last_name  age           city debt
0      Jason       NaN   42  San Francisco  NaN
1      Molly       NaN   52      Baltimore  NaN
2       Tina       NaN   36          Miami  NaN
3       Jake       NaN   24        Douglas  NaN
4        Amy       NaN   73         Boston  NaN

In [78]:
df['first_name']   # col 기준으로 Series 추출

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [79]:
df.loc[1]      # index location을 기준으로 instance 추출

first_name        Molly
last_name           NaN
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [80]:
df['age'].iloc[1:]     # iloc은 index number를 기준으로 추출

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [81]:
s = pd.Series(np.nan, index = [49, 48, 47, 46, 45, 1, 2, 3, 4, 5])
s.loc[:3]    # 49, 48, 47이 아니라 3번 index 전까지 추출됨

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [82]:
s.iloc[:3]    # 49, 48, 47이 추출됨

49   NaN
48   NaN
47   NaN
dtype: float64

In [83]:
df.debt = df.age > 40
df.debt   # boolean값으로 생성됨

0     True
1     True
2    False
3    False
4     True
Name: debt, dtype: bool

In [84]:
df

  first_name last_name  age           city   debt
0      Jason       NaN   42  San Francisco   True
1      Molly       NaN   52      Baltimore   True
2       Tina       NaN   36          Miami  False
3       Jake       NaN   24        Douglas  False
4        Amy       NaN   73         Boston   True

In [85]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name             NaN        NaN    NaN      NaN     NaN
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [86]:
df.values

array([['Jason', nan, 42, 'San Francisco', True],
       ['Molly', nan, 52, 'Baltimore', True],
       ['Tina', nan, 36, 'Miami', False],
       ['Jake', nan, 24, 'Douglas', False],
       ['Amy', nan, 73, 'Boston', True]], dtype=object)

In [87]:
del df["debt"]    # 특정 column을 삭제

In [88]:
df

  first_name last_name  age           city
0      Jason       NaN   42  San Francisco
1      Molly       NaN   52      Baltimore
2       Tina       NaN   36          Miami
3       Jake       NaN   24        Douglas
4        Amy       NaN   73         Boston

In [89]:
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9}, 
      'Ohio' : {2000 : 1.5, 2001 : 1.7, 2002 : 3.6}}       # Nested Dict로 column 추가 가능
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

#### Selection

In [90]:
df["first_name"].head(3)

0    Jason
1    Molly
2     Tina
Name: first_name, dtype: object

In [91]:
df[['first_name', 'age']]

  first_name  age
0      Jason   42
1      Molly   52
2       Tina   36
3       Jake   24
4        Amy   73

In [92]:
df = pd.read_excel("excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [93]:
df['account'][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [94]:
account_series = df['account']
account_series[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [95]:
account_series[[0, 5, 8, 15, 20]]

0     211829.0
5     132971.0
8     209744.0
15         NaN
20         NaN
Name: account, dtype: float64

In [96]:
account_series[account_series > 25000]

0     211829
1     320563
2     648336
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
13    268755
14    273274
Name: account, dtype: int64

In [97]:
df.index = df['account']
del df['account']
df.head()    # account를 데이터프레임의 index로 사용하기

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [98]:
df.iloc[[1, 4, 5]]

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000

#### drop

In [99]:
df.index = range(0, 15)
df.head(5)

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [100]:
df.drop(1)

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [101]:
df.drop([0, 1, 2, 3])

,name,street,city,state,postal-code,Jan,Feb,Mar
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [102]:
df.drop('city', axis = 1)

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

--------------------------------------------

#### Dataframe Operations

In [103]:
s1 = Series(range(1, 6), index = list("abced"))

s2 = Series(range(5, 11), index = list('bcedef'))

In [104]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [105]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [106]:
s1.add(s2, fill_value = 0)    # 빈 칸에 0을 채워서 덧셈 연산 수행

a     1.0
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f    10.0
dtype: float64

In [107]:
df1 = DataFrame(np.arange(9).reshape(3, 3),
               columns = list('abc'))
df2 = DataFrame(np.arange(16).reshape(4, 4),
               columns = list('abcd'))

In [108]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [109]:
df1.add(df2, fill_value=999)    # 빈 칸에 0을 채워서 덧셈 연산 수행

        a       b       c       d
0     0.0     2.0     4.0  1002.0
1     7.0     9.0    11.0  1006.0
2    14.0    16.0    18.0  1010.0
3  1011.0  1012.0  1013.0  1014.0

In [110]:
df = DataFrame(np.arange(16).reshape(4, 4),
              columns = list('abcd'))
s = Series(np.arange(10, 14))

In [111]:
df + s    # column을 기준으로 broadcasting이 발생

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [112]:
df.add(s, axis = 0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

In [113]:
df.add(s, axis = 1)

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

----------------------------------

#### lambda, map, apply

In [114]:
ex = [1, 2, 3, 4, 5]
f = lambda x : x**2
list(map(f, ex))   # 함수와 sequence형 데이터를 인자로 받아, 데이터의 각 원소에 함수를 수행하여 다시 리스트로 반환

[1, 4, 9, 16, 25]

In [115]:
s1 = Series(np.arange(10))
s1.map(lambda x : x**2).head()     # Series 데이터 타입에도 map 적용 가능

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [116]:
z = {1 : 'A', 2 : 'B', 3 : 'C'}
s1.map(z).head(5)    # dict type으로 데이터값을 바꿀 수 있다.

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [117]:
s2 = Series(np.arange(10, 20))
s1.map(s2).head()      # 같은 위치의 데이터를 s2로 전환할 수 있다.

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [118]:
#### Example ####
df = pd.read_csv('wages.csv')
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [119]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [120]:
df['sex_code'] = df.sex.map({'male' : 0, 'female' : 1})
df.head()      # 성별을 0과 1로 코딩

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [121]:
df.sex.replace({'male' : 0, 'female' : 1}).head()     # 데이터 변환을 한다면 map이 아닌 replace도 많이 사용한다.

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [122]:
df.sex.replace(['male', 'female'], [0, 1], inplace = True)     # inplace는 실제 데이터프레임까지 변환시키는 keyword
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [123]:
df_info = df[['earn', 'height', 'age']]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [124]:
f = lambda x : Series([x.max() - x.min()], index = ['min', 'max'])
df_info.apply(f)     # 각 원소에 함수를 적용하는 map과는 달리, column 단위로 연산을 수행함

              earn  height  age
min  318047.708444   19.87   73
max  318047.708444   19.87   73

In [125]:
f = lambda x : -x
df_info.applymap(f).head(5)       # 데이터프레임의 전체 원소에 함수를 적용

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

#### pandas Built-in functions

In [126]:
df.describe()         # R에서의 summary와 비슷한 기능

,earn,height,sex,ed,age,sex_code
count,1379.000000,1379.000000,1379.000000,1379.000000,1379.000000,1379.000000
mean,32446.292622,66.592640,0.622915,13.354605,45.328499,0.622915
std,31257.070006,3.818108,0.484832,2.438741,15.789715,0.484832
min,-98.580489,57.340000,0.000000,3.000000,22.000000,0.000000
25%,10538.790721,63.720000,0.000000,12.000000,33.000000,0.000000
50%,26877.870178,66.050000,1.000000,13.000000,42.000000,1.000000
75%,44506.215336,69.315000,1.000000,15.000000,55.000000,1.000000
max,317949.127955,77.210000,1.000000,18.000000,95.000000,1.000000

In [127]:
df.race.unique()        # 유일한 값을 가져오는 방법

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [128]:
np.array(dict(enumerate(df['race'].unique())))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [129]:
value = list(map(int, np.array(list(enumerate(df['race'].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df['race'].unique())), dtype = str)[:, 1].tolist()
value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [130]:
df['race'].replace(to_replace = key, value = value)       # 수동으로 label encoding하기

0       0
1       0
2       0
3       1
4       0
5       0
6       0
7       0
8       2
9       0
10      0
11      0
12      0
13      0
14      0
15      0
16      0
17      0
18      0
19      0
20      0
21      3
22      3
23      0
24      0
25      0
26      0
27      0
28      3
29      0
       ..
1349    0
1350    0
1351    0
1352    0
1353    0
1354    0
1355    0
1356    3
1357    0
1358    0
1359    0
1360    0
1361    0
1362    0
1363    3
1364    0
1365    0
1366    3
1367    1
1368    2
1369    2
1370    1
1371    0
1372    0
1373    0
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

#### groupby
 sql의 groupby와 같은 명령어  
 spliy -> apply -> combine의 순서로 연산

In [131]:
ipl_data= {'Team' : ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
          'Rank' : [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
          'Year' : [2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017],
          'Points' : [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]}
df = pd.DataFrame(ipl_data)
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [133]:
df.groupby('Team')['Points'].sum()   # Team 기준으로 Points를 합산하여 계산

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [135]:
df.groupby(['Team', 'Year'])['Points'].sum()   # 두 가지 이상의 Column을 리스트로 묶어서 인자로 할당할 수 있음

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

groupby 명령어로 두 개 이상의 column을 입력해도 결국 index가 여러 개인 hieratchical index의 데이터프레임이 생성됨  

 => unstack 사용

In [141]:
df.groupby(['Team', 'Year'])['Points'].sum().unstack()
# Matrix 형태로 반환

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

In [145]:
print(df.groupby(['Team', 'Year'])['Points'].sum().swaplevel())   # index level 변경
print(df.groupby(['Team', 'Year'])['Points'].sum().sort_index(level = 0))

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2015  Kings     812
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
Name: Points, dtype: int64
Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64